var store = [{
        "title": "공변성, 반공변성, 무공변성 차이",
        "excerpt":"공변성, 반공변성, 무공변성이란? 이펙티브 코틀린 코틀린 공부를 해본 사람이라면 대부분은 읽어봤을 “이펙티브 코틀린”에서 공변성, 반공변성이라는 단어가 나옵니다. 책을 읽어봐도 쉽게 이해되지 않는 단어이기 때문에 간단하게 정리를 해보려 합니다. Generics 아래 코드와 같이 제너릭은 동일한 코드로 여러 타입을 지원해주기 위해 존재합니다. 한가지 타입에 대한 템플릿이 아니라 여러가지 타입을 사용할 수 있는...","categories": ["자바&코틀린하린"],
        "tags": [],
        "url": "/%EC%9E%90%EB%B0%94&%EC%BD%94%ED%8B%80%EB%A6%B0%ED%95%98%EB%A6%B0/%EA%B3%B5%EB%B3%80%EC%84%B1,%EB%B0%98%EA%B3%B5%EB%B3%80%EC%84%B1,%EB%AC%B4%EA%B3%B5%EB%B3%80%EC%84%B1/",
        "teaser": null
      },{
        "title": "GitHub Actions을 이용한 AWS Lambda 배포 자동화",
        "excerpt":"AWS Lambda AWS Lambda은 서버를 프로비저닝하거나 관리하지 않고도 코드를 실행할 수 있게 해주는 컴퓨팅 서비스입니다. 따라서 개발자가 서버에 대한 신경 쓸 필요 없이 코드에 집중할 수 있도록 도와줍니다. 그리고 이때 사용한 컴퓨팅 시간, 용량에 대해서만 AWS에게 비용을 지불하면 됩니다. 그래서 코드를 계속 실행시키기보다는 특정한 시기에만 실행시키는 경우에 Lambda를 사용하면 유용한데,...","categories": ["ETC"],
        "tags": [],
        "url": "/ETC/%EB%9E%8C%EB%8B%A4/",
        "teaser": null
      }]
